gbhand/nRF51x-Sensors/main.c
/** STATUS: ADC simple works
  *         SD Card code initializes, but not tested with hardware
  *         LSM via SPI is disabled
  *
  * NOTES:  Issues with sdk_config caused hangs
  *         watch out for conflicting defines and SPI instantiation
  *
  * DONE:   Expand ADC to all devices (and that IT WORKS)
  *
  * TODO:   Configure ADC to be saved to SD card (do this later)
**/
 







/**
 * Copyright (c) 2015 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
   
#include "nrf.h"
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "nordic_common.h"

#include "nrf_drv_adc.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_spi.h"
#include "nrf_drv_timer.h"

#include "ff.h"
#include "diskio_blkdev.h"
#include "nrf_block_dev_sdc.h"
   


#include "app_util_platform.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "boards.h"
#include "app_error.h"
#include <string.h>

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
   
//#define NRF_LOG_MODULE_NAME "APP"

//#define SPI_INSTANCE  0 /**< SPI instance index. */
//static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
//static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */
//
//// LSM6DS3 defines
//#define WHO_AM_I                0x0F
//
//#define CTRL1_XL                0x10
//#define CTRL6_C                 0x15
//
//#define OUTX_L_XL               0x28
//
//#define STATUS_REG              0x1E
//
//#define XL_POWER_DOWN           0x00
//#define XL_52Hz                 0x30
//#define XL_HM_MODE              0x08
//
//#define VERBOSE                 true
//#define LSM_ENABLE              false
//
//uint8_t tx_data[8];
//uint8_t rx_data[8];

//uint8_t spiCommandData[8];
//uint8_t spiReadData[8];
//static uint8_t       m_tx_buf[] = TEST_STRING;           /**< TX buffer. */
//static uint8_t       m_rx_buf[sizeof(TEST_STRING) + 1];    /**< RX buffer. */
//static const uint8_t m_length = sizeof(m_rx_buf - 1);        /**< Transfer length. */

// ADC defines
#define ADC_BUFFER_SIZE                 4                                            //Size of buffer for ADC samples. Buffer size should be multiple of number of adc channels located.
#define ADC_SAMPLE_RATE     		20                                        //ADC sampling frequencyng frequency in ms
#define ADC_ENABLE                      true

static nrf_adc_value_t          adc_buffer[ADC_BUFFER_SIZE]; /**< ADC buffer. */
static nrf_ppi_channel_t        m_ppi_channel;
static const nrf_drv_timer_t    m_timer = NRF_DRV_TIMER_INSTANCE(2);
static uint32_t                  adc_event_counter = 0;
static uint8_t                  number_of_adc_channels;

// SD Card defines
#define FILE_NAME                       "NORDIC.TXT"
#define TEST_STRING                     "SD card example.\r\n"
#define TEST_DATA                       0x42
static uint8_t dt[2];
#define FATFS_EXAMPLE                   false
#define FATFS_ENABLE                    true

#define SDC_SCK_PIN                     9  ///< SDC serial clock (SCK) pin.
#define SDC_MOSI_PIN                    8  ///< SDC serial data in (DI) pin.
#define SDC_MISO_PIN                    10  ///< SDC serial data out (DO) pin.
#define SDC_CS_PIN                      13  ///< SDC chip select (CS) pin.

static void fatfs_write(uint8_t *to_write, uint8_t input_size);

// ADC section
/**@brief FatFs-enabled ADC interrupt handler.
 * 
 * Prints ADC results on hardware UART and over BLE via the NUS service.
 */
static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
{
  
    /** Old implementation -> NOT WORKING

    uint8_t adc_result[ADC_BUFFER_SIZE*2];
	
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        adc_event_counter++;
        NRF_LOG_INFO("  adc event counter: %d\r\n", adc_event_counter);
        for (uint32_t i = 0; i < p_event->data.done.size; i++)
        {
            NRF_LOG_INFO("ADC value channel %d: %d\r\n", (int)(i % number_of_adc_channels), p_event->data.done.p_buffer[i]);
            adc_result[(i*2)] = p_event->data.done.p_buffer[i] >> 8;
            adc_result[(i*2)+1] = p_event->data.done.p_buffer[i];
        }
        
        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));

