gbhand/nRF51x-Sensors/main.c
    }
    
    if (adc_result[0] == 0) 
    {
      NRF_LOG_INFO("huh? adc_result is zero...\r\n");
    }

    **/ //end
    
    /** New implementation -> TODO
    **/
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        uint32_t i;
        NRF_LOG_RAW_INFO("Event %d |", adc_event_counter);
        for (i = 0; i < p_event->data.done.size; i++)
        {
            if (i < 4 && number_of_adc_channels)
            {
//                NRF_LOG_RAW_INFO("\t\tCh %d:\t\t%d", (i % number_of_adc_channels), p_event->data.done.p_buffer[i]);
                NRF_LOG_RAW_INFO("\t\tCh %d:\t\t%d", i, p_event->data.done.p_buffer[i]);
                uint8_t arr[2];
                arr[0] = p_event->data.done.p_buffer[i] & 0xFF;
                arr[1] = (p_event->data.done.p_buffer[i] >> 8);
            
                fatfs_write(&arr[0], 1);
            }
        }
        NRF_LOG_RAW_INFO("\t\t\tidx = %d\r\n", i);
    adc_event_counter++;
    }
    APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
    
//    NRF_LOG_INFO("ADC result from channel 1: %d%d\r\n", adc_result[0], adc_result[1]);
//    NRF_LOG_INFO("ADC result from channel 2: %d%d\r\n", adc_result[2], adc_result[3]);
}


///**@brief ADC interrupt handler.
// * 
// * Prints ADC results on hardware UART and over BLE via the NUS service.
// */
//static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
//{
//  
//    /** Old implementation -> NOT WORKING
//
//    uint8_t adc_result[ADC_BUFFER_SIZE*2];
//	
//    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
//    {
//        adc_event_counter++;
//        NRF_LOG_INFO("  adc event counter: %d\r\n", adc_event_counter);
//        for (uint32_t i = 0; i < p_event->data.done.size; i++)
//        {
//            NRF_LOG_INFO("ADC value channel %d: %d\r\n", (int)(i % number_of_adc_channels), p_event->data.done.p_buffer[i]);
//            adc_result[(i*2)] = p_event->data.done.p_buffer[i] >> 8;
//            adc_result[(i*2)+1] = p_event->data.done.p_buffer[i];
//        }
//        
//        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
//
//    }
//    
//    if (adc_result[0] == 0) 
//    {
//      NRF_LOG_INFO("huh? adc_result is zero...\r\n");
//    }
//
//    **/ //end
//    
//    /** New implementation -> TODO
//    **/
//    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
//    {
//        uint32_t i;
//        NRF_LOG_INFO("  adc event counter: %d\r\n", adc_event_counter);
//        for (i = 0; i < p_event->data.done.size; i++)
//        {
//            NRF_LOG_INFO("ADC value channel %d: %d\r\n", (i % number_of_adc_channels), p_event->data.done.p_buffer[i]);
//        }
//    adc_event_counter++;
//    }
//    APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
//    
////    NRF_LOG_INFO("ADC result from channel 1: %d%d\r\n", adc_result[0], adc_result[1]);
////    NRF_LOG_INFO("ADC result from channel 2: %d%d\r\n", adc_result[2], adc_result[3]);
//}

/**@brief TIMER interrupt handler.
 * 
 */
void timer_handler(nrf_timer_event_t event_type, void* p_context)
{
}

/**@brief ADC initialization.
 * 
 */
static void adc_config(void)
{
    ret_code_t ret_code;
	
    //Initialize ADC
    nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;
    ret_code = nrf_drv_adc_init(&config, adc_event_handler);
    APP_ERROR_CHECK(ret_code);
	
    //Configure and enable ADC channel 0
    static nrf_drv_adc_channel_t m_channel_0_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_0); 
    m_channel_0_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
    nrf_drv_adc_channel_enable(&m_channel_0_config);
	
    //Configure and enable ADC channel 1
    static nrf_drv_adc_channel_t m_channel_1_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_1); 
    m_channel_1_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
    nrf_drv_adc_channel_enable(&m_channel_1_config);
	
    //Configure and enable ADC channel 2
    static nrf_drv_adc_channel_t m_channel_2_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_2);	
    m_channel_2_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
    nrf_drv_adc_channel_enable(&m_channel_2_config);
    
    //Configure and enable ADC channel 3
    static nrf_drv_adc_channel_t m_channel_3_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_7);	
    m_channel_2_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
    nrf_drv_adc_channel_enable(&m_channel_3_config);
	
    number_of_adc_channels = 4;    //Set equal to the number of configured ADC channels, for the sake of UART output.
}

/**@brief ADC sampling event enable
  *
  */
void adc_sampling_event_enable(void)
{
    ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);
}

/**@brief Setup ADC sampling events.
 * 
 */
void adc_sampling_event_init(void)
{
    ret_code_t err_code;
    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_config = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_config.frequency = NRF_TIMER_FREQ_31250Hz;
    err_code = nrf_drv_timer_init(&m_timer, &timer_config, timer_handler);
    APP_ERROR_CHECK(err_code);

    /* setup m_timer for compare event */
    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer,ADC_SAMPLE_RATE);
    nrf_drv_timer_extended_compare(&m_timer, NRF_TIMER_CC_CHANNEL0, ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
    nrf_drv_timer_enable(&m_timer);

    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer, NRF_TIMER_CC_CHANNEL0);
    uint32_t adc_sample_event_addr = nrf_drv_adc_start_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel, timer_compare_event_addr, adc_sample_event_addr);  //NRF_ADC->TASKS_START);
    APP_ERROR_CHECK(err_code);
}



//// LSM6DS3 section
//
//void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
//{
//    spi_xfer_done = true;
//    NRF_LOG_INFO("Transfer completed.\r\n");
////    if (VERBOSE && rx_data != 0)
////    {
////        uint32_t result = rx_data[0];
////        NRF_LOG_INFO("EVENT_Received: %d\r\n", result);
////    }
//    if (VERBOSE && rx_data[1] != 0)
//    {
//        uint32_t result = rx_data[0];
//        NRF_LOG_INFO("EVENT_Received: %d\r\n", result);
//        result = rx_data[1];
//        NRF_LOG_INFO("EVENT_Received: %d\r\n", result);
//    }
//}
//
//void send(uint8_t sizetx, uint8_t sizerx)
//{
//  memset(rx_data, 0, sizeof(rx_data));
//  spi_xfer_done = false;
//  NRF_LOG_INFO("calling spi transfer...\r\n");
//  APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, tx_data, sizetx, rx_data, sizerx));
//  
//  while (!spi_xfer_done)
//  {
//    __WFE();
//  }
//  
//  if(sizerx!=0)
//  {
////	NRF_LOG_INFO("Received[0]: %x %x %x %x %x %x \n\r",m_rx_buf[0],m_rx_buf[1],m_rx_buf[2],m_rx_buf[3],m_rx_buf[4],m_rx_buf[5]);
////	NRF_LOG_INFO("Received[1]: %x %x %x %x %x %x \n\r",m_rx_buf[6],m_rx_buf[7],m_rx_buf[8],m_rx_buf[9],m_rx_buf[10],m_rx_buf[11]);
//    NRF_LOG_INFO("Received: %x\r\n", rx_data[0]);
//  }
//  
//  NRF_LOG_FLUSH();
//}
//
//void set_accel_freq(void)
//{
//    // Config accel to 52Hz
//    tx_data[0] = CTRL1_XL;      // 0x10
//    tx_data[1] = XL_52Hz;   // 0x30
//    send(2, 1);
//}
//
//void set_accel_low_power(void)
//{
//  // Enable low power mode
//    tx_data[0] = CTRL6_C;       // 0x15
//    tx_data[1] = XL_HM_MODE;    // 0x08
//    send(2, 1);
//}
//
//void power_down_accel(void)
//{
//  // Power down
//      tx_data[0] = CTRL1_XL;            // 0x10
//      tx_data[1] = XL_POWER_DOWN;       // 0x00    
//      send(2, 1);
//}
//
//void who_am_i(void)
//{
//    tx_data[0] = 0x8F;
//    tx_data[1] = 0x00;
//    memset(rx_data, 0x00, 8);
////    uint8_t spiReadData[] = {0x00, 0x00};
//    
//    nrf_drv_spi_transfer(&spi, tx_data, 2, rx_data, 2);
//    NRF_LOG_FLUSH();
//    
//    
//    // New who_am_i
//    tx_data[0] = (WHO_AM_I | 0x80);      // 0x0F
////    NRF_LOG_INFO("sending %x\r\n", tx_data[0]);
////    NRF_LOG_FLUSH();
//    send(1, 1);
//    tx_data[0] = 0x00;
////    NRF_LOG_INFO("sending %x\r\n", tx_data[0]);
////    NRF_LOG_FLUSH();
//    send(1,1);
//    
//    if (rx_data[0] == 0x69)
//    {
//      NRF_LOG_INFO("Correct who_am_i: 0x69\r\n");
//    }
//    else
//    {
//      NRF_LOG_INFO("Unknown device: %x\r\n", rx_data[0]);
//    }
//}
//
//void LSM6DS3_init(void)
//{ 
//    NRF_LOG_INFO("LSM6DS3 init begin...\r\n");
//    
////    who_am_i();
//    
//    // Enable low power mode
//    set_accel_low_power();
//    
//    // Config accel to 52Hz
//    set_accel_freq();   
//}
//
//void LSM6DS3_read_accel(int16_t *x_axis, int16_t *y_axis, int16_t *z_axis)
//{
//  uint8_t status = 0;
//  uint8_t data[6];
//  
//  tx_data[0] = STATUS_REG;
//  
//  // Ensures LSM6DS3 has data ready
//  do {
//    send(1,1);
//    status = rx_data[0];
//  } while(!(status & 0x01));
//  
//  // Read data from accel register
//  tx_data[0] = OUTX_L_XL;
//  send(1,6);
//  
//  power_down_accel();
//  
//  *data = *rx_data;
//  *x_axis = (data[1] << 8) | data[0];
//  *y_axis = (data[3] << 8) | data[2];
//  *z_axis = (data[5] << 8) | data[4];
//}







// SD Card section
/**@brief  SDC block device definition
 * 
 * */
NRF_BLOCK_DEV_SDC_DEFINE(
        m_block_dev_sdc,
        NRF_BLOCK_DEV_SDC_CONFIG(
                SDC_SECTOR_SIZE,
                APP_SDCARD_CONFIG(SDC_MOSI_PIN, SDC_MISO_PIN, SDC_SCK_PIN, SDC_CS_PIN)
         ),
         NFR_BLOCK_DEV_INFO_CONFIG("Nordic", "SDC", "1.00")
);

