gbhand/nRF51x-Sensors/main.c
/**@brief FATFS initialization
  *
  */
static void fatfs_init()
{
    static FATFS fs;
    static DIR dir;
    static FILINFO fno;
//    static FIL file;

//    uint32_t bytes_written;
    FRESULT ff_result;
    DSTATUS disk_state = STA_NOINIT;

    // Initialize FATFS disk I/O interface by providing the block device.
    static diskio_blkdev_t drives[] =
    {
            DISKIO_BLOCKDEV_CONFIG(NRF_BLOCKDEV_BASE_ADDR(m_block_dev_sdc, block_dev), NULL)
    };

    diskio_blockdev_register(drives, ARRAY_SIZE(drives));

    NRF_LOG_INFO("Initializing disk 0 (SDC)...\r\n");
    for (uint32_t retries = 3; retries && disk_state; --retries)
    {
        disk_state = disk_initialize(0);
    }
    if (disk_state)
    {
        NRF_LOG_INFO("Disk initialization failed.\r\n");
        return;
    }
    
    uint32_t blocks_per_mb = (1024uL * 1024uL) / m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_size;
    uint32_t capacity = m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_count / blocks_per_mb;
    NRF_LOG_INFO("Capacity: %d MB\r\n", capacity);

    NRF_LOG_INFO("Mounting volume...\r\n");
    ff_result = f_mount(&fs, "", 1);
    if (ff_result)
    {
        NRF_LOG_INFO("Mount failed.\r\n");
        return;
    }

    NRF_LOG_INFO("\r\n Listing directory: /\r\n");
    ff_result = f_opendir(&dir, "/");
    if (ff_result)
    {
        NRF_LOG_INFO("Directory listing failed!\r\n");
        return;
    }
    
    do
    {
        ff_result = f_readdir(&dir, &fno);
        if (ff_result != FR_OK)
        {
            NRF_LOG_INFO("Directory read failed.");
            return;
        }
        
        if (fno.fname[0])
        {
            if (fno.fattrib & AM_DIR)
            {
                NRF_LOG_RAW_INFO("   <DIR>   %s\r\n",(uint32_t)fno.fname);
            }
            else
            {
                NRF_LOG_RAW_INFO("%9lu  %s\r\n", fno.fsize, (uint32_t)fno.fname);
            }
        }
    }
    while (fno.fname[0]);
    NRF_LOG_RAW_INFO("\r\n");
    
}

/**@brief Write sample to FATFS
  *
  */
static void fatfs_write_test()
{
    static FIL file;
    
    uint32_t bytes_written;
    FRESULT ff_result;
    
  
    NRF_LOG_INFO("[TEST] Writing sample to file " FILE_NAME "...\r\n");
    ff_result = f_open(&file, FILE_NAME, FA_READ | FA_WRITE | FA_OPEN_APPEND);
    if (ff_result != FR_OK)
    {
        NRF_LOG_INFO("Unable to open or create file: " FILE_NAME ".\r\n");
//        return; //TEMP UNCOMMENT
    }
    
//    NRF_LOG_INFO("Attemping to write TEST_STRING:\r\n");
//    NRF_LOG_HEXDUMP_INFO(&TEST_STRING, sizeof(TEST_STRING));

    ff_result = f_write(&file, TEST_STRING, sizeof(TEST_STRING) - 1, (UINT *) &bytes_written);
    if (ff_result != FR_OK)
    {
        NRF_LOG_INFO("Write failed\r\n.");
    }
    else
    {
        NRF_LOG_INFO("%d bytes written.\r\n", bytes_written);
    }

    (void) f_close(&file);
    NRF_LOG_INFO("[TEST] Ending test...\r\n");
    return;
}

/**@brief Write to FATFS
  *
  */
static void fatfs_write(uint8_t *to_write, uint8_t input_size)
{
//    int[1] to_write = {42};
    
    static FIL file;
    
    uint32_t bytes_written;
    FRESULT ff_result;
    
//    NRF_LOG_INFO("\r\n\r\n\r\n\r\nTESTING DATA\r\n\r\ndata = %x\r\n", to_write[0]);
//    NRF_LOG_FLUSH();
    
    // testing
//    uint32_t arrsz = 4;
//    uint32_t input_size = sizeof(to_write) / sizeof(*to_write);
//    for(uint32_t i = 0; i < input_size; i++)
//    {
//      NRF_LOG_INFO("index: %d\r\n", i);
//      NRF_LOG_INFO("value: %x\r\n", to_write[i]);
//      NRF_LOG_FLUSH();
//    }
    
  
//    NRF_LOG_INFO("Writing to file " FILE_NAME "...\r\n");
    ff_result = f_open(&file, FILE_NAME, FA_READ | FA_WRITE | FA_OPEN_APPEND);
    if (ff_result != FR_OK)
    {
        NRF_LOG_DEBUG("Unable to open or create file: " FILE_NAME ".\r\n");
//        return; //TEMP UNCOMMENT
    }

//    ff_result = f_write(&file, to_write, 1, (UINT *) &bytes_written);
//    if (ff_result != FR_OK)
//    {
//        NRF_LOG_DEBUG("Write failed\r\n.");
//    }
//    else
//    {
//        NRF_LOG_DEBUG("%d bytes written.\r\n", bytes_written);
//    }
    
    for(uint32_t i = 0; i < input_size; i++)
    {
//        NRF_LOG_RAW_INFO(" (%X)", to_write[i]);
        NRF_LOG_DEBUG("Writing byte %d, value: %x\r\n.", i, to_write[i]);
        ff_result = f_write(&file, to_write, 1, (UINT *) &bytes_written);
        if (ff_result != FR_OK)
        {
            NRF_LOG_RAW_INFO(" +");
            NRF_LOG_DEBUG("Write failed for byte %d, value: %x\r\n.", i, to_write[i]);
        }
        else
        {
            NRF_LOG_RAW_INFO(" *");
            NRF_LOG_DEBUG("%d bytes written for byte %d, value: %x\r\n.", bytes_written, i, to_write[i]);
        }
    }
        

    (void) f_close(&file);
    return;
}

/**@brief Function for demonstrating FAFTS usage.
 * 
 */
static void fatfs_example()
{
    static FATFS fs;
    static DIR dir;
    static FILINFO fno;
    static FIL file;

    uint32_t bytes_written;
    FRESULT ff_result;
    DSTATUS disk_state = STA_NOINIT;

    // Initialize FATFS disk I/O interface by providing the block device.
    static diskio_blkdev_t drives[] =
    {
            DISKIO_BLOCKDEV_CONFIG(NRF_BLOCKDEV_BASE_ADDR(m_block_dev_sdc, block_dev), NULL)
    };

    diskio_blockdev_register(drives, ARRAY_SIZE(drives));

    NRF_LOG_INFO("Initializing disk 0 (SDC)...\r\n");
    for (uint32_t retries = 3; retries && disk_state; --retries)
    {
        disk_state = disk_initialize(0);
    }
    if (disk_state)
    {
        NRF_LOG_INFO("Disk initialization failed.\r\n");
        return;
    }
    
    uint32_t blocks_per_mb = (1024uL * 1024uL) / m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_size;
    uint32_t capacity = m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_count / blocks_per_mb;
    NRF_LOG_INFO("Capacity: %d MB\r\n", capacity);

    NRF_LOG_INFO("Mounting volume...\r\n");
    ff_result = f_mount(&fs, "", 1);
    if (ff_result)
    {
        NRF_LOG_INFO("Mount failed.\r\n");
        return;
    }

    NRF_LOG_INFO("\r\n Listing directory: /\r\n");
    ff_result = f_opendir(&dir, "/");
    if (ff_result)
    {
        NRF_LOG_INFO("Directory listing failed!\r\n");
        return;
    }
    
    do
    {
        ff_result = f_readdir(&dir, &fno);
        if (ff_result != FR_OK)
        {
            NRF_LOG_INFO("Directory read failed.");
            return;
        }
        
