gbhand/nRF51x-Sensors/main.c
        if (fno.fname[0])
        {
            if (fno.fattrib & AM_DIR)
            {
                NRF_LOG_RAW_INFO("   <DIR>   %s\r\n",(uint32_t)fno.fname);
            }
            else
            {
                NRF_LOG_RAW_INFO("%9lu  %s\r\n", fno.fsize, (uint32_t)fno.fname);
            }
        }
    }
    while (fno.fname[0]);
    NRF_LOG_RAW_INFO("\r\n");
    
    NRF_LOG_INFO("Writing to file " FILE_NAME "...\r\n");
    ff_result = f_open(&file, FILE_NAME, FA_READ | FA_WRITE | FA_OPEN_APPEND);
    if (ff_result != FR_OK)
    {
        NRF_LOG_INFO("Unable to open or create file: " FILE_NAME ".\r\n");
        return;
    }

    ff_result = f_write(&file, TEST_STRING, sizeof(TEST_STRING) - 1, (UINT *) &bytes_written);
    if (ff_result != FR_OK)
    {
        NRF_LOG_INFO("Write failed\r\n.");
    }
    else
    {
        NRF_LOG_INFO("%d bytes written.\r\n", bytes_written);
    }

    (void) f_close(&file);
    return;
}



// Main section
int main(void)
{
    // ADC Section
    adc_sampling_event_init();
    adc_config();
    adc_sampling_event_enable();
    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));
    
    NRF_LOG_INFO("    ADC example\r\n");

    APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
    
    
    
    
    // FatFs Section
    if (FATFS_EXAMPLE && FATFS_ENABLE)
    {
        NRF_LOG_INFO("\r\nFATFS example.\r\n\r\n");
        
        fatfs_example();
    }
    else if (FATFS_ENABLE)
    {
      NRF_LOG_INFO("\r\nFATFS normal usage.\r\n\r\n");
      NRF_LOG_FLUSH();
      fatfs_init();
      fatfs_write_test();
//      fatfs_write(TEST_STRING);
      dt[0] = 0x42;
      dt[1] = 0x69;
      fatfs_write(&dt[0], 2);
      NRF_LOG_FLUSH();
    }
    
    
    
    NRF_LOG_INFO("\r\n\r\n*****\r\n\r\n\r\nBeginning main process\r\n\r\n\r\n*****\r\n\r\n");
    
    while (true)
    {
        __WFE();    
        __SEV();
        __WFE();
        NRF_LOG_FLUSH();
    }

    

//    if (LSM_ENABLE)
//    {
//      NRF_LOG_INFO("\r\n\r\n\r\nSPI example\r\n");
//      NRF_LOG_FLUSH();
//      
//      nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
//      spi_config.ss_pin   = SPI_SS_PIN;
//      spi_config.miso_pin = SPI_MISO_PIN;
//      spi_config.mosi_pin = SPI_MOSI_PIN;
//      spi_config.sck_pin  = SPI_SCK_PIN;
//      APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));
//      
//      NRF_LOG_INFO("Initializing IMU\r\n");
//      NRF_LOG_FLUSH();
//      LSM6DS3_init();
//      nrf_delay_ms(500);
//      NRF_LOG_INFO("Reading IMU\r\n");
//      NRF_LOG_FLUSH();
//      LSM6DS3_read_accel(accel_x, accel_y, accel_z);
//      nrf_delay_ms(500);
//      
//      NRF_LOG_INFO("Accelerometer values read:\r\n");
//      NRF_LOG_INFO("X: %d\t Y: %d\t Z: %d\t\r\n", *accel_x, *accel_y, *accel_z);
//      NRF_LOG_FLUSH();
//    }
    
//    if (ADC_ENABLE)
//    {
//        adc_sampling_event_init();
//        adc_config();
////        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
//        adc_sampling_event_enable();
//        
//        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
//        
//        for (uint8_t i = 0; i < 100; i++)
//        {
//          __WFE();    
//          __SEV();
//          __WFE();
//          NRF_LOG_FLUSH();
//        }
//    }
    
//    // Continue sampling LSM6DS3 (and hopefully ADC too)
//    if (LSM_ENABLE)
//    {
//      for (int i = 0; i < 100; i++)
//      {
//        LSM6DS3_read_accel(accel_x, accel_y, accel_z);
//        
//        NRF_LOG_INFO("Accelerometer values read:\r\n");
//        NRF_LOG_INFO("X: %d\t Y: %d\t Z: %d\t\r\n", *accel_x, *accel_y, *accel_z);
//        NRF_LOG_FLUSH();
//        nrf_delay_ms(500);
//      }
//    }
      
    
    
    
//    NRF_LOG_INFO("End of execution...\r\n");
//    NRF_LOG_FLUSH();
//    
//    return 0;
}
